RIET/src/InformationRegisters/StagesOfExportRequests/StagesOfExportRequests.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>StagesOfExportRequests</name>
  <resources>
    <name>Stage</name>
    <type>
      <types>EnumRef.ExportStages</types>
    </type>
  </resources>
  <resources>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ExportRequest</name>
    <type>
      <types>DocumentRef.ExportRequest</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/InformationRegisters/StagesOfExportRequests/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	
	Для Каждого Запись Из ЭтотОбъект Цикл
					
		КлючЗаписи = Неопределено;
		
		Если НЕ ЗначениеЗаполнено(Запись.ExportRequest) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"""Export request"" is empty!",
				ПолучитьКлючЗаписи(Запись, КлючЗаписи), "ExportRequest", "Запись", Отказ);			
		КонецЕсли;
			
		Если НЕ ЗначениеЗаполнено(Запись.Stage) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"""Stage"" is empty!",
				ПолучитьКлючЗаписи(Запись, КлючЗаписи), "Stage", "Запись", Отказ);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Запись.ModificationDate) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"""Modification date"" is empty!",
				ПолучитьКлючЗаписи(Запись, КлючЗаписи), "ModificationDate", "Запись", Отказ);
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьКлючЗаписи(Запись, КлючЗаписи)
	
	Если КлючЗаписи = Неопределено Тогда
		СтруктураЗаписи = Новый Структура("ExportRequest");
		ЗаполнитьЗначенияСвойств(СтруктураЗаписи, Запись);
		КлючЗаписи = РегистрыСведений.StagesOfExportRequests.СоздатьКлючЗаписи(СтруктураЗаписи);
	КонецЕсли; 
		
	Возврат КлючЗаписи;
	
КонецФункции
